//------维持8114的“R-1-1-18 数组定义禁止没有显式的边界限定” 

int main(void)
{
	int x0[5];                          //遵循
	int x1[] = { 1, 2, 3 };               //违背
	int x2[] = { 1, 2, 3, 0 };            //违背
	int x3[5] = { 1 };                     //遵循
	int x4[5] = { 0 };                     //遵循
	int x5[5] = { 1, 2, 3 };               //遵循
	int x6[5] = { 1, 2, 3, 0 };            //遵循
	//int x7[5] = {1, 2, 3, 4, 5, 6};      //编译不通过
	char y0[5];                          //遵循
	char y1[] = { 'a', 'b', 'c' };        //违背
	char y2[] = { 'a', 'b', 'c', '\0' };  //违背
	char y3[5] = { 'a', 'b', 'c' };        //遵循
	char y4[5] = { 'a', 'b', 'c', '\0' };  //遵循
	char y5[] = "abc";                  //违背
	char y6[3] = "abc";                  //遵循本条款，但违背其它条款
	char y7[4] = "abc";                  //遵循
	return (0);
}
